from utils import *

def process_data(data, steps): ##pipeline
    for step in steps:
        data = step(data)
    return data

def time_decorator(func): ##시간 측정용 데코레이션
    off = False
    def decorated(*args, **kwargs):
        s= time.time()
        val = func(*args, **kwargs)
        print(f"{time.time()-s:.4f} 초")
        return val
    if off:
        return func
    return decorated

def log(text, printTime=True, prefix=" "):
    s = ""
    if printTime:
        s += f"[{time.ctime(time.time())}]"
    s += prefix
    s += text

    with open(log_path, "a+") as f:
        f.write(s+"\n")

def error(processName, e=None):
    exc_type, exc_obj, exc_tb = sys.exc_info()
    fname = os.path.split(exc_tb.tb_frame.f_code.co_filename)[1]
    log(f"{processName}중 오류 발생")
    log(f"error name: {exc_type}",           printTime=False, prefix="-")
    log(f"file name: {fname}",                  printTime=False, prefix="-")
    log(f"error line: {exc_tb.tb_lineno}", printTime=False, prefix="-")
    log("종료\n")
    
    exit(0)

def save(label, val, fileName, clear=True):
    path = os.path.join(real_path, "data", fileName)
    
    if clear:
        with open(path, "w") as f:
            f.write("")
    for l, v in zip(label, val):
        data = f"{l} {' '.join(map(str, v))}" + "\n"
        
        with open(path, "a+") as f:
            f.write(data)


def multi_decorator(func): ##시간 측정용 데코레이션
    def decorated(data):
        for i in range(len(data)):
            data[i] = func(data[i])
        return data
    return decorated

#region #불용어(최소한 okt로는 더 이상 나뉘지 않는 형태소들임)
# non_meaning = ['아', '휴', '아이구', '아이쿠', '아이고', '어', '나', '우리', '저희', '따라', '의해', '을', '를', '에', '의', '가', '으로', '로', '에게', '들면', '들자면', '저', '소인', '소생', '저희', '지말고', '하지마', '하지마라', '다른', '물론', '또한', '그리고', '비길수', '없다', '해서는', '안된다', '아니라', '만이', '아니다', '만은', '아니다', '관계없이', '그치지', '않다', '그러나', '그런데', '하지만', '않다', '따지지', '않다', '설사', '비록', '더라도', '아니면', '만', '하는', '편이', '낫다', '틈타', '타다', '오르다', '이', '이', '밖에', '하여야', '비로소', '한다면', '몰라도', '여기', '부터', '따라서', '할', '하려고하다', '그리하여', '그렇게', '하지만', '보는데서', '으로써', '로써', '까지', '일것이다', '반드시', '할수있다', '할수있어', '틀림없다', '한다면', '등', '등등', '제', '겨우', '단지', '다만', '딩동', '댕그', '훨씬', '얼마나', '얼마만큼', '남짓', '여', '얼마간', '약간', '다소', '좀', '조금', '다수', '몇', '얼마', '지만', '하물며', '또한', '그러나', '그렇지만', '하지만', '대해', '바꾸어서', '바꾸어서', '한다면', '만약', '까악', '툭', '딱', '보드득', '꽈당', '응당', '에', '가서', '각', '각각', '여러분', '각종', '각자', '제각기', '와', '과', '그러므로', '그래서', '고로', '한', '하기', '거니와', '이지만', '과연', '실로', '하', '하하', '허허', '아하', '거바', '와', '오', '왜', '어째서', '어찌', '하겠는가', '무슨', '어디', '더군다나', '하물며', '언제', '야', '어이', '흐흐', '흥', '휴', '헉헉', '헐떡헐떡', '영차', '끙끙', '아야', '앗', '아야', '콸콸', '졸졸', '좍좍', '뚝뚝', '주룩주룩', '솨', '우르르', '그래도', '또', '그리고', '바꾸어말하면', '바꾸어말하자면', '혹은', '혹시', '및', '따르는', '되어', '즉', '지든지', '설령', '가령', '하더라도', '할지라도', '지든지', '몇', '거의', '하마터면', '인젠', '만큼', '게다가', '보아', '비추어', '보아', '일것이다', '좀', '시키다', '하게하다', '의해서', '이어서', '잇따라', '뒤따라', '결국', '자마자', '더욱더', '마음대로', '않고', '곧', '즉시', '바로', '당장', '밖에', '안된다', '그래', '그렇지', '요컨대', '다시', '바꿔', '즉', '이상', '허', '헉', '허걱', '게다가', '더구나', '하물며', '와르르', '팍', '퍽', '펄렁', '동안', '이래', '하고있었다', '이었다', '에서', '로부터', '까지', '했어요', '함께', '같이', '더불어', '마저', '마저도', '양자', '모두', '습니다', '가까스로', '하려고하다', '다른', '다른', '해봐요', '습니까', '했어요', '없고', '하는것만', '하는것이', '낫다', '매', '매번', '들', '모', '어느', '로써', '갖고말하자면', '어디', '어느', '년도', '라', '해도', '언젠가', '어떤것', '저기', '저쪽', '그때', '그럼', '그러면', '그래', '그때', '그저', '이르기까지', '할', '줄', '안다', '할', '있다', '너', '너희', '당신', '어찌', '설마', '차라리', '할지언정', '할지라도', '할지언정', '게우다', '퉤', '쳇', '의해', '따라', '그', '다음', '버금', '기타', '쓰여', '단지', '전후', '전자', '잠시', '잠깐', '하면서', '그렇지만', '같다', '비슷하다', '예컨대', '어떻게', '만약', '만일', '인', '하지', '않는다면', '무엇', '무슨', '어느', '어떤', '조차', '한데', '그럼에도', '여전히', '심지어', '까지도', '조차도', '하지', '않도록', '않기', '때', '시각', '무렵', '시간', '동안', '어때', '어떠한', '하여금', '네', '예', '우선', '누구', '누가', '알겠는가', '몰랏다', '하는', '겸사겸사', '그런', '한', '그러니', '그러니까', '그', '너희', '타인', '것', '너', '하기', '어찌하여', '붕붕', '윙윙', '나', '우리', '엉엉', '휘익', '윙윙', '오호', '아하', '만', '하기보다는', '차라리', '하는', '편이', '낫다', '흐흐', '놀라다', '마치', '아니라면', '쉿', '그렇지', '않으면', '그렇지', '않다면', '안', '그러면', '아니었다면', '아니면', '좋아', '알았어', '하는것도', '없다', '하나', '일', '일단', '전부', '한마디', '하기에', '아울러', '하지', '않도록', '않기', '이르기까지', '이', '되다', '로', '인하여', '이로', '인하여', '그래서', '이', '그러므로', '그런', '알', '수', '있다', '낼', '수', '있다', '으로', '인하여', '있다', '어떤것', '있다', '있다', '에', '대해', '그리하여', '여부', '하기보다는', '하느니', '하면', '할수록', '운운', '하구나', '하도다', '다시말하면', '에', '있다', '에', '달려', '있다', '우리', '오히려', '하기는한데', '어떻게', '어떻해', '어때', '어째서', '자', '이', '여기', '이번', '이런', '이러한', '같은', '것', '얼마', '안', '되는', '것', '이', '이렇게', '많은', '것', '같다', '이렇구나', '같이', '끼익', '삐걱', '따위', '와', '같은', '왜냐하면', '오직', '오로지', '에', '한하다', '하기만', '하면', '까지', '미치다', '이르다', '할', '이르다', '여러분', '하고', '있다', '한', '후', '혼자', '자기', '자신', '보면', '대로', '하다', '으로서', '참', '할', '쿵', '탕탕', '쾅쾅', '둥둥', '봐', '봐라', '아이야', '아니', '와아', '응', '아이', '참나', '년', '월', '일', '령', '영', '일', '이', '삼', '사', '오', '육', '륙', '칠', '팔', '구', '이천육', '이천칠', '이천팔', '이천구', '하나', '둘', '셋', '넷', '다섯', '여섯', '일곱', '여덟', '아홉', '령', '영', '이', '있', '하', '것', '들', '그', '되', '수', '이', '보', '않', '없', '나', '사람', '주', '아니', '등', '같', '우리', '때', '년', '가', '한', '지', '대하', '오', '말', '일', '그렇', '때문', '그것', '두', '알', '그러나', '받', '일', '그런', '또', '문제', '더', '사회', '많', '그리고', '좋', '크', '따르', '중', '나오', '가지', '씨', '시키', '만들', '지금', '그러', '속', '하나', '집', '살', '모르', '적', '월', '데', '자신', '안', '어떤', '내', '내', '경우', '명', '생각', '시간', '그녀', '다시', '이런', '앞', '보이', '번', '나', '다른', '어떻', '여자', '개', '전', '들', '사실', '이렇', '점', '싶', '말', '정도', '좀', '원', '잘', '놓']
#endregion
